In [3]:
import pandas as pd
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [5]:
seri = pd.Series([10,88,3,4,5])

In [7]:
type(seri)

pandas.core.series.Series

In [9]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [11]:
seri.dtype

dtype('int64')

In [13]:
seri.size

5

In [15]:
seri.ndim

1

In [17]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [19]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [21]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [23]:
#index isimlendirmesi

In [25]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [27]:
pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [29]:
#sozluk uzerinden liste olusturma

In [31]:
sozluk = {"reg":10,"log":11,"cart":12}

In [33]:
seri = pd.Series(sozluk)

In [35]:
seri

reg     10
log     11
cart    12
dtype: int64

In [37]:
#iki seriyi birlestirerek seri olusturma

In [39]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [41]:
#ELEMAN İŞLEMLERİ

In [43]:
import numpy as np

In [45]:
a = np.array([1,2,33,444,75])

In [47]:
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [49]:
seri[0]

1

In [51]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [53]:
seri = pd.Series([121,200,150,99],
                 index = ["reg","loj","cat","rf"])

In [55]:
seri

reg    121
loj    200
cat    150
rf      99
dtype: int64

In [57]:
seri.index

Index(['reg', 'loj', 'cat', 'rf'], dtype='object')

In [59]:
seri.keys

<bound method Series.keys of reg    121
loj    200
cat    150
rf      99
dtype: int64>

In [61]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cat', 150), ('rf', 99)]

In [63]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [65]:
#Eleman Sorgulama

In [67]:
"reg" in seri

True

In [69]:
"a" in seri

False

In [71]:
seri["reg"]

121

In [73]:
#Fancy eleman

In [75]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [77]:
seri["reg"] = 130

In [79]:
seri["reg"]

130

In [81]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

In [83]:
#PANDAS DATAFRAME OLUŞTURMA

In [85]:
import pandas as pd

In [87]:
l = [1,2,39,67,90]

In [89]:
l

[1, 2, 39, 67, 90]

In [91]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [93]:
import numpy as np

In [95]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [97]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [99]:
#DF İsimlendirme

In [101]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [105]:
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [107]:
type(df)

pandas.core.frame.DataFrame

In [109]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [111]:
df.shape

(3, 3)

In [113]:
df.ndim

2

In [116]:
df.size

9

In [118]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [120]:
type(df.values)

numpy.ndarray

In [122]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [124]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [126]:
a = np.array([1,2,3,4,5])

In [128]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [130]:
#ELEMAN İŞLEMLERİ

In [132]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10, size = 5)

In [134]:
sozluk = {"var1" : s1,"var2" : s2,"var3" : s3}

In [136]:
sozluk

{'var1': array([0, 5, 8, 9, 7]),
 'var2': array([1, 4, 1, 2, 6]),
 'var3': array([3, 1, 1, 5, 9])}

In [138]:
df = pd.DataFrame(sozluk)

In [140]:
df

   var1  var2  var3
0     0     1     3
1     5     4     1
2     8     1     1
3     9     2     5
4     7     6     9

In [142]:
df[0:1]

   var1  var2  var3
0     0     1     3

In [144]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [148]:
df.index = ["a","b","c","d","e"]

In [150]:
df

   var1  var2  var3
a     0     1     3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [152]:
df["c" : "e"]

   var1  var2  var3
c     8     1     1
d     9     2     5
e     7     6     9

In [154]:
#Silme

In [156]:
df.drop("a", axis = 0)

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [158]:
df

   var1  var2  var3
a     0     1     3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [160]:
df.drop("a", axis = 0,inplace = True)

In [162]:
df

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [164]:
#fancy

In [166]:
l = ["c","e"]

In [168]:
df.drop(l, axis =0)

   var1  var2  var3
b     5     4     1
d     9     2     5

In [170]:
#Değişkenler için

In [172]:
df

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [174]:
"var1" in df

True

In [176]:
l = ["var1","var4","var2"]

In [178]:
for i in l:
    print(i in df)

True
False
True

In [180]:
df

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [182]:
df["var1"]

b    5
c    8
d    9
e    7
Name: var1, dtype: int32

In [184]:
df["var4"] = df["var1"] / df["var2"]

In [186]:
df

   var1  var2  var3      var4
b     5     4     1  1.250000
c     8     1     1  8.000000
d     9     2     5  4.500000
e     7     6     9  1.166667

In [188]:
#Değişken silmek

In [190]:
df.drop("var4",axis = 1)

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [192]:
df

   var1  var2  var3      var4
b     5     4     1  1.250000
c     8     1     1  8.000000
d     9     2     5  4.500000
e     7     6     9  1.166667

In [194]:
df.drop("var4", axis = 1, inplace = True)

In [196]:
df

   var1  var2  var3
b     5     4     1
c     8     1     1
d     9     2     5
e     7     6     9

In [198]:
l = ["var1","var2"]

In [200]:
df.drop(l, axis = 1)

   var3
b     1
c     1
d     5
e     9

In [202]:
#GÖZLEM VE DEĞİŞKEN SEÇİMİ: LOC & İLOC

In [204]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    24    11    11
1     2     5     8
2     5     4    28
3    20    25    23
4    20    15    13
5     1    12    15
6    10    28    10
7    10    20     9
8    24    17    29
9    15    28     7

In [206]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [208]:
df.loc[0:3]

   var1  var2  var3
0    24    11    11
1     2     5     8
2     5     4    28
3    20    25    23

In [210]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [212]:
df.iloc[0:3]

   var1  var2  var3
0    24    11    11
1     2     5     8
2     5     4    28

In [214]:
df.iloc[0,0]

24

In [216]:
df

   var1  var2  var3
0    24    11    11
1     2     5     8
2     5     4    28
3    20    25    23
4    20    15    13
5     1    12    15
6    10    28    10
7    10    20     9
8    24    17    29
9    15    28     7

In [218]:
df.iloc[:3,:2]

   var1  var2
0    24    11
1     2     5
2     5     4

In [220]:
df.loc[:3,"var3"]

0    11
1     8
2    28
3    23
Name: var3, dtype: int32

In [222]:
df.loc[0:3, "var3"]

0    11
1     8
2    28
3    23
Name: var3, dtype: int32

In [224]:
df.iloc[0:3]["var3"]

0    11
1     8
2    28
Name: var3, dtype: int32

In [226]:
#KOŞULLU ELEMAN İŞLEMLERİ

In [236]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     4    11     6
1    23    10    23
2    13     7    15
3    22     7     1
4     3    29    28
5    29    20    25
6    28     5    25
7     6    15     3
8    15     4    21
9     2    20     3

In [238]:
df["var1"]

0     4
1    23
2    13
3    22
4     3
5    29
6    28
7     6
8    15
9     2
Name: var1, dtype: int32

In [240]:
df[0:2][["var1","var2"]]

   var1  var2
0     4    11
1    23    10

In [242]:
df

   var1  var2  var3
0     4    11     6
1    23    10    23
2    13     7    15
3    22     7     1
4     3    29    28
5    29    20    25
6    28     5    25
7     6    15     3
8    15     4    21
9     2    20     3

In [244]:
df.var1

0     4
1    23
2    13
3    22
4     3
5    29
6    28
7     6
8    15
9     2
Name: var1, dtype: int32

In [246]:
df[df.var1 > 15]

   var1  var2  var3
1    23    10    23
3    22     7     1
5    29    20    25
6    28     5    25

In [250]:
df[(df.var1 >15)& (df.var3 < 5)]

   var1  var2  var3
3    22     7     1

In [255]:
df.loc[(df.var1 >15), ["var1", "var2"]]

   var1  var2
1    23    10
3    22     7
5    29    20
6    28     5

In [257]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    23    10
3    22     7
5    29    20
6    28     5

In [259]:
#BİRLEŞTİRME (JOIN) İŞLEMLERİ

In [53]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    15     8    25
1     7    14    29
2    29    23     1
3     7    14     3
4    16    16    13

In [263]:
df2 = df1 + 99

In [265]:
df2

   var1  var2  var3
0   110   120   122
1   100   114   100
2   121   101   123
3   122   125   104
4   103   118   107

In [267]:
pd.concat([df1,df2])

   var1  var2  var3
0    11    21    23
1     1    15     1
2    22     2    24
3    23    26     5
4     4    19     8
0   110   120   122
1   100   114   100
2   121   101   123
3   122   125   104
4   103   118   107

In [269]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\hhati\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [271]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    11    21    23
1     1    15     1
2    22     2    24
3    23    26     5
4     4    19     8
5   110   120   122
6   100   114   100
7   121   101   123
8   122   125   104
9   103   118   107

In [275]:
df2.columns = ["var1","var2","deg3"]

In [277]:
df2

   var1  var2  deg3
0   110   120   122
1   100   114   100
2   121   101   123
3   122   125   104
4   103   118   107

In [279]:
df1

   var1  var2  var3
0    11    21    23
1     1    15     1
2    22     2    24
3    23    26     5
4     4    19     8

In [281]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    11    21  23.0    NaN
1     1    15   1.0    NaN
2    22     2  24.0    NaN
3    23    26   5.0    NaN
4     4    19   8.0    NaN
0   110   120   NaN  122.0
1   100   114   NaN  100.0
2   121   101   NaN  123.0
3   122   125   NaN  104.0
4   103   118   NaN  107.0

In [283]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0    11    21
1     1    15
2    22     2
3    23    26
4     4    19
0   110   120
1   100   114
2   121   101
3   122   125
4   103   118

In [291]:
#İLERİ BİRLEŞTİRME İŞLEMLERİ

In [293]:
#Birebir birleştirme

In [55]:
df1 = pd.DataFrame({'calisanlar': ['Ali','Veli','Ayse','Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik','Muhendislik','İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [300]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali','Veli','Fatma'],
                    'ilk_giris': [2010, 2009, 2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [302]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [304]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [306]:
#Çoktan teke

In [308]:
df3 = pd.merge(df1,df2)

In [310]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [312]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [314]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [316]:
#Çoktan çoka

In [318]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe', 'Muhendislik','Muhendislik','İK','İK']})
df5

          grup
0     Muhasebe
1     Muhasebe
2  Muhendislik
3  Muhendislik
4           İK
5           İK

In [320]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [324]:
pd.merge(df1,df5)

  calisanlar         grup
0        Ali     Muhasebe
1        Ali     Muhasebe
2       Veli  Muhendislik
3       Veli  Muhendislik
4       Ayse  Muhendislik
5       Ayse  Muhendislik
6      Fatma           İK
7      Fatma           İK

In [2]:
#TOPLULAŞTIRMA VE GRUPLAMA (AGGREGATİON & GROUPİNG)

Basit toplulaştırma fonksiyonları:

count()
first()
last()
mean()
median()
min()
max()
std()
var()
sum()

In [7]:
import seaborn as sns

In [11]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\hhati\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [19]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [21]:
df.shape

(1035, 6)

In [29]:
df["mass"].mean()

2.6381605847953216

In [31]:
df["mass"].count()

513

In [33]:
df["mass"].min()

0.0036

In [35]:
df["mass"].sum()

1353.37638

In [37]:
df["mass"].std()

3.8186166509616046

In [39]:
df["mass"].var()

14.58183312700122

In [41]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [45]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [47]:
#GRUPLAMA İŞLEMLERİ

In [57]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [59]:
df.groupby("gruplar")

In [61]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [63]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [65]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [67]:
df.groupby("method")

In [69]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [71]:
#İLERİ TOPLULAŞTIRMA İŞLEMLERİ (AGGREGATE, FİLTER, APPLY)

In [73]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1' : [10,23,33,22,11,99],
                   'degisken2' : [100,253,333,262,111,969]},
                  columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [75]:
#aggregate

In [77]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [81]:
df.groupby("gruplar").aggregate([min, np.median, max])

C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\2594767197.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby("gruplar").aggregate([min, np.median, max])
C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\2594767197.py:1: FutureWarning: The provided callable <function median at 0x000001EC104E0A40> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("gruplar").aggregate([min, np.median, max])
C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\2594767197.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("gruplar").aggregate([min, np.median, max])
C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\2594767197.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [83]:
df.groupby("gruplar").aggregate({"degisken1" : "min","degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [85]:
#Filter

In [87]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [89]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [91]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [93]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [95]:
#Transform

In [105]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [107]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [109]:
df_a = df.iloc[:,1:3]

In [111]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [113]:
#apply

In [115]:
import pandas as pd
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [117]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [121]:
df.groupby("gruplar").apply(np.mean)

gruplar
A     98.5
B     99.5
C    358.5
dtype: float64

In [123]:
#PİVOT TABLOLAR

In [125]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [129]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\2203689429.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [131]:
#Pivot ile table

In [133]:
titanic.pivot_table("survived",index = "sex", columns = "class")

C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\607342342.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived",index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [135]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [137]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [139]:
titanic.pivot_table("survived",["sex",age], "class")

C:\Users\hhati\AppData\Local\Temp\ipykernel_16040\219744178.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived",["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663